import { z } from "zod";

export const AddVacancySchema = z.object({
    company: z
        .string()
        .max(40, "Максимальна довжина 40 символів")
        .min(2, "Мінімальна довжина 2 символи")
        .trim(),
    position: z
        .string()
        .max(30, "Максимальна довжина 30 символів")
        .min(2, "Мінімальна довжина 2 символи")
        .trim(),
    link: z
        .string()
        .url("Некоректний формат URL")
        .max(254, "Максимальна довжина 254 символи")
        .min(4, "Мінімальна довжина 4 символи")
        .trim(),
    communication: z
        .string()
        .max(4000, "Максимальна довжина 4000 символів")
        .min(10, "Мінімальна довжина 10 символів")
        .trim(),
    location: z
        .string()
        .max(400, "Максимальна довжина 400 символів")
        .min(4, "Мінімальна довжина 10 символів")
        .trim(),
    notes: z
        .string()
        .max(4000, "Максимальна довжина 4000 символів")
        .trim(),
});
